---
kind: property
id: P:Autodesk.Revit.DB.DisciplineTypeId.Common
source: html/5b6cf262-3ac4-5892-3b00-7ff599b38afc.htm
---
# Autodesk.Revit.DB.DisciplineTypeId.Common Property

Common.

## Syntax (C#)
```csharp
public static ForgeTypeId Common { get; }
```